Config/Documents/РаспределениеВходящегоНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РаспределениеВходящегоНДС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВходящийНДСКРаспределению</xr:Item>
				<xr:Item>AccumulationRegister.НДСНеоблагаемыеОперации</xr:Item>
				<xr:Item>InformationRegister.ОперацииКапвложений</xr:Item>
				<xr:Item>AccumulationRegister.ВходящийНДС</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыРасчетовСУчредителями</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРеализацииВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРеализацииНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРеализацииОблагаемаяБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставРаспределяемыхСумм</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектНалогообложения</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
								<v8:Type>cfg:DocumentRef.РегистрацияСтрокиКнигиПродаж</v8:Type>
								<v8:Type>cfg:DocumentRef.КассовоеПоступление</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеНаСчет</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеМЗВПути</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеОСВПути</v8:Type>
								<v8:Type>cfg:DocumentRef.ПередачаОбъектаОС</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаявкаНаКассовыйРасходСокращенная</v8:Type>
								<v8:Type>cfg:DocumentRef.НакладнаяНаРеализациюТорг12</v8:Type>
								<v8:Type>cfg:DocumentRef.ПередачаГруппОбъектовОС</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаявкаНаКассовыйРасход</v8:Type>
								<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
								<v8:Type>cfg:DocumentRef.РСКППеречисление</v8:Type>
								<v8:Type>cfg:DocumentRef.СписаниеДоходовБудущихПериодов</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетОРасходахПодотчетногоЛица</v8:Type>
								<v8:Type>cfg:DocumentRef.АктОбОказанииУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
								<v8:Type>cfg:DocumentRef.КассовоеВыбытие</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежноеПоручение</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеУслугРабот</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеУслугРаботПоСчетамУчетаЗатрат</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеОС</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеМЗ</v8:Type>
								<v8:Type>cfg:DocumentRef.ПередачаОбъектовОС</v8:Type>
								<v8:Type>cfg:DocumentRef.НачислениеАмортизацииПравПользованияОС</v8:Type>
								<v8:Type>cfg:DocumentRef.ЭквайринговаяОперация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦенности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЦенностейНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДСВсего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДСКВычету</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДСВСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДт</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭКСчетаДебета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПССчетаДебета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоУчету</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоВалютная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДСВсегоВалютная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДСКВычетуВалютная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДСВСтоимостьВалютная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтразитьВКарточкеКапвложений</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КарточкаКапвложений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КарточкиКапвложений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Documents/РаспределениеВходящегоНДС/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем ТекстЗаголовкаСообщений;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ,
													 СтандартнаяОбработка, 
													 Элементы.БухгалтерскаяОперация, 
													 Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	НастроитьФормуСервер();
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	СчетаКапвложений.ЗагрузитьЗначения(ОбслуживаниеКарточекКапвложений.СчетаКапвложенийДляКарточкиКапвложений());

	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ТекстЗаголовкаСообщений = НСтр("ru='Распределение входящего НДС'");
	
	НадписьНалоговыйПериод = ПолучитьТекстНадписиНалоговогоПериода(Объект["Организация"], Объект["Дата"]);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

    // Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма,
												   ТекущийОбъект, 
												   Элементы.БухгалтерскаяОперация, 
												   Элементы.ДополнительныеТабличныеЧасти);
    // Конец Типовые операции и дополнительные табличные части
	
	
	// Отметка корректности сумм в строках таблицы:
	РассчитатьКолонкиОтметитьСтрокуНаСервере();
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтаФорма);

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

    // Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	// Отметка корректности сумм в строках таблицы:
	РассчитатьКолонкиОтметитьСтрокуНаСервере();
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	НадписьНалоговыйПериод = ПолучитьТекстНадписиНалоговогоПериода(Объект["Организация"], Объект["Дата"]);
	
КонецПроцедуры
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	НадписьНалоговыйПериод = ПолучитьТекстНадписиНалоговогоПериода(Объект["Организация"], Объект["Дата"]);
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаРеализацииОблагаемаяБезНДСПриИзменении(Элемент)
	
	РезультатРасчета = РассчитатьДолюПринимаемуюКВычету(Объект);
	
	НастроитьФормуПослеРасчетаДолиКВычету(ЭтаФорма, РезультатРасчета);
	
КонецПроцедуры
&НаКлиенте
Процедура СуммаРеализацииВсегоПриИзменении(Элемент)
	
	РезультатРасчета = РассчитатьДолюПринимаемуюКВычету(Объект);
	
	НастроитьФормуПослеРасчетаДолиКВычету(ЭтаФорма, РезультатРасчета);
	
КонецПроцедуры
&НаКлиенте
Процедура СуммаРеализацииНДСПриИзменении(Элемент)
	
	РезультатРасчета = РассчитатьДолюПринимаемуюКВычету(Объект);
	
	НастроитьФормуПослеРасчетаДолиКВычету(ЭтаФорма, РезультатРасчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоляПринимаемаяКВычетуПриИзменении(Элемент)
	
	Если ДоляПринимаемаяКВычету > 1 Тогда
		ДоляПринимаемаяКВычету = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СуммыКРаспределению

&НаКлиенте
Процедура СоставРаспределяемыхСуммВсегоПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставРаспределяемыхСуммСтавкаНДСПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке(Элемент);
	
КонецПроцедуры
&НаКлиенте
Процедура СоставРаспределяемыхСуммСуммаНДСВсегоПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставРаспределяемыхСуммСуммаНДСКВычетуПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставРаспределяемыхСуммСуммаНДСВСтоимостьПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставРаспределяемыхСуммВсегоВалютнаяПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставРаспределяемыхСуммСуммаНДСВсегоВалютнаяПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставРаспределяемыхСуммСуммаНДСКВычетуВалютнаяПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставРаспределяемыхСуммСуммаНДСВСтоимостьВалютнаяПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставРаспределяемыхСуммСчетДтПриИзменении(Элемент)
	
	ТекДанные = Элементы["СоставРаспределяемыхСумм"].ТекущиеДанные;
	
	СвойстваСчета = ПолучитьСвойстваСчета(ТекДанные["СчетДт"]);
	
	НомерСубконто	= СвойстваСчета["НомерСубконтоВидыЗатрат"];
	КЭКДт			= СвойстваСчета["КЭКДт"];
	
	Если ЗначениеЗаполнено(НомерСубконто) Тогда
		ТекДанные["СубконтоДт" + НомерСубконто] = Объект["ВидЗатрат"];
	КонецЕсли;
	
	ТекДанные["КЭКСчетаДебета"] = КЭКДт;
	
	УстановитьФлажокОтразитьВКарточкеКапвложений(ТекДанные, СчетаКапвложений);
КонецПроцедуры

&НаКлиенте
Процедура СоставРаспределяемыхСуммКЭКСчетаДебетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.СоставРаспределяемыхСумм.ТекущиеДанные;
    	
	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораКЭК(Элемент, 
								СтандартнаяОбработка,
								ТекущиеДанные.КЭКСчетаДебета,
								Объект.Организация, 
								Объект.ИФО,
								ТекущиеДанные.КФО, 
                                ТекущиеДанные.СчетДт,
								Объект.Дата,
								"Дт");
КонецПроцедуры
							
&НаКлиенте
Процедура СоставРаспределяемыхСуммСубконтоДт1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Объект.Организация,
													Элементы.СоставРаспределяемыхСумм.ТекущиеДанные.СубконтоДт1,,"СубконтоДт");
КонецПроцедуры
&НаКлиенте
Процедура СоставРаспределяемыхСуммСубконтоДт2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Объект.Организация,
													Элементы.СоставРаспределяемыхСумм.ТекущиеДанные.СубконтоДт2,,"СубконтоДт");
КонецПроцедуры
&НаКлиенте
Процедура СоставРаспределяемыхСуммСубконтоДт3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Объект.Организация,
													Элементы.СоставРаспределяемыхСумм.ТекущиеДанные.СубконтоДт3,,"СубконтоДт");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	ПроверитьИЗаполнитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСуммыРеализации(Команда)
	
	ПроверитьИЗаполнитьСуммыРеализации();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьБезАналитики(Команда)
	
	ПроверитьИЗаполнитьСуммыКРаспределению(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСАналитикой(Команда)
	
	ПроверитьИЗаполнитьСуммыКРаспределению(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьПоПропорции(Команда)
	
	ПроверитьИРаспределитьПоПропорции();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСчетаДебетаВтаблице(Команда)
	
	ОткрытьФормуЗаполненияСчетаДтКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрупповоеЗаполнениеСтрок(Команда)
	
	КоличествоСтрок = Элементы["СоставРаспределяемыхСумм"].ВыделенныеСтроки.Количество();
	
	Если КоличествоСтрок = 0 Тогда
		
		ТекстСообщения = НСтр("ru='Выделите несколько строк для выполнения группового заполнения'");
		
		ПоказатьПредупреждение(, ТекстСообщения, 20);
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыФормы = ПолучитьПараметрыФормыГрупповогоЗаполненияСтрок(КоличествоСтрок);
	
	ОповещениеВыбор = Новый ОписаниеОповещения("ЗакрытаФормаГрупповогоЗаполненияСтрок", ЭтотОбъект);
	
	ОткрытьФорму("Документ.РаспределениеВходящегоНДС.Форма.ФормаЗаполненияСчетаДт", ПараметрыФормы, ЭтаФорма,,,,ОповещениеВыбор, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьРасшифровкуСумм(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ШапкаДокумента", ПолучитьСтруктуруШапкиДокумента());
	
	ОткрытьФорму("Документ.РаспределениеВходящегоНДС.Форма.Расшифровка", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьФормуСервер()
	
	РезультатРасчета = РассчитатьДолюПринимаемуюКВычету(Объект);
	
	НастроитьФормуПослеРасчетаДолиКВычету(ЭтаФорма, РезультатРасчета);
	
	НастроитьЭлементыИтогов();
	
	Элементы["СоставРаспределяемыхСуммВалюта"].Видимость = ИспользоватьВалютныйУчет;
	
	Элементы.СоставРаспределяемыхСуммПодразделение.Видимость = Документы.РаспределениеВходящегоНДС.ИспользуетсяКолонкаПодразделение();
	
	//---
	// Аналог установки свойства ТолькоПросмотр, но с возможностью открытия значения
	//---
	ТолькоПросмотр_ПоДаннымУчета_ИнициализацияСервер();
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекстНадписиНалоговогоПериода(Организация, Дата)
	
	Если ЗначениеЗаполнено(Дата) Тогда
		СвойстваНалоговогоПериода = УчетНДС.ПолучитьСвойстваНалоговогоПериода(Организация, Дата);
		Результат = СвойстваНалоговогоПериода["ПериодПредставление"]
			+ " (" + СвойстваНалоговогоПериода["ПериодПредставлениеДиапазон"] + ")";	
	Иначе
		Результат = НСтр("ru='<заполните дату документа>'");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСвойстваСчета(СчетСсылка)
	
	Возврат Документы.РаспределениеВходящегоНДС.ПолучитьСвойстваСчета(СчетСсылка);
	
КонецФункции

&НаСервере
Процедура РассчитатьКолонкиОтметитьСтрокуНаСервере()
	
	ТаблЧасть = Объект["СоставРаспределяемыхСумм"];
	Для Каждого СтрокаТЧ Из ТаблЧасть Цикл
		ОбновитьЗначенияОтметитьСтроку(СтрокаТЧ);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЗначенияОтметитьСтроку(СтрокаТЧ)
	
	СтрокаТЧ["ОтметитьКолонкиКВычетуИВСтоимость"] = НЕ (СтрокаТЧ["СуммаНДСВсего"] =
		СтрокаТЧ["СуммаНДСКВычету"] + СтрокаТЧ["СуммаНДСВСтоимость"]);
		
	СтрокаТЧ["ОтметитьКолонкиКВычетуИВСтоимостьВалютная"] = НЕ (СтрокаТЧ["СуммаНДСВсегоВалютная"] =
		СтрокаТЧ["СуммаНДСКВычетуВалютная"] + СтрокаТЧ["СуммаНДСВСтоимостьВалютная"]);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммыВСтроке(Элемент)
	
	ТекДанные = Элементы["СоставРаспределяемыхСумм"].ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Множитель = УчетНДСКлиентСервер.ПолучитьМножительСтавки(ТекДанные.СтавкаНДС, Истина);
	
	ИмяПоля = СтрЗаменить(Элемент.Имя, "СоставРаспределяемыхСумм", "");
	
	ПрименитьПропорциюРубли = (ИмяПоля = "Всего" ИЛИ ИмяПоля = "СуммаНДСВсего" ИЛИ ИмяПоля = "СтавкаНДС");
	
	ПрименитьПропорциюВалюта = (ИмяПоля = "ВсегоВалютная" ИЛИ ИмяПоля = "СуммаНДСВсегоВалютная" ИЛИ ИмяПоля = "СтавкаНДС");
		
	Если ИмяПоля = "СуммаНДСВСтоимость" Тогда
		
		ТекДанные["СуммаНДСКВычету"] = ТекДанные["СуммаНДСВсего"] - ТекДанные["СуммаНДСВСтоимость"];
		
	ИначеЕсли ИмяПоля = "СуммаНДСВСтоимостьВалютная" Тогда
		
		ТекДанные["СуммаНДСКВычетуВалютная"] = ТекДанные["СуммаНДСВсегоВалютная"] - ТекДанные["СуммаНДСВСтоимостьВалютная"];
		
	ИначеЕсли ИмяПоля = "СуммаНДСКВычету" Тогда
		
		ТекДанные["СуммаНДСВСтоимость"] = ТекДанные["СуммаНДСВсего"] - ТекДанные["СуммаНДСКВычету"];
		
	ИначеЕсли ИмяПоля = "СуммаНДСКВычетуВалютная" Тогда
		
		ТекДанные["СуммаНДСВСтоимостьВалютная"] = ТекДанные["СуммаНДСВсегоВалютная"] - ТекДанные["СуммаНДСКВычетуВалютная"];
		
	ИначеЕсли ИмяПоля = "Всего" Тогда
		
		ТекДанные["СуммаНДСВсего"] = ТекДанные["Всего"] * Множитель;
		
	ИначеЕсли ИмяПоля = "ВсегоВалютная" Тогда
		
		ТекДанные["СуммаНДСВсегоВалютная"] = ТекДанные["ВсегоВалютная"] * Множитель;
		
	ИначеЕсли ИмяПоля = "СтавкаНДС" Тогда
		
		ТекДанные["СуммаНДСВсего"] = ТекДанные["Всего"] * Множитель;
		
		ТекДанные["СуммаНДСВсегоВалютная"] = ТекДанные["ВсегоВалютная"] * Множитель;
		
	ИначеЕсли ИмяПоля = "СуммаНДСВсего" Тогда
		
		ТекДанные["Всего"] = ТекДанные["СуммаНДСВсего"] / Множитель;
		
	ИначеЕсли ИмяПоля = "СуммаНДСВсегоВалютная" Тогда
		
		ТекДанные["ВсегоВалютная"] = ТекДанные["СуммаНДСВсегоВалютная"] / Множитель;
		
	КонецЕсли;
	
	
	Если ПрименитьПропорциюРубли Тогда
		
		ТекДанные["СуммаНДСКВычету"] = ТекДанные["СуммаНДСВсего"] * ДоляПринимаемаяКВычету;
		
		ТекДанные["СуммаНДСВСтоимость"] = ТекДанные["СуммаНДСВсего"] - ТекДанные["СуммаНДСКВычету"];
		
	КонецЕсли;
	
	Если ПрименитьПропорциюВалюта Тогда
		
		ТекДанные["СуммаНДСКВычетуВалютная"] = ТекДанные["СуммаНДСВсегоВалютная"] * ДоляПринимаемаяКВычету;
		
		ТекДанные["СуммаНДСВСтоимостьВалютная"] = ТекДанные["СуммаНДСВсегоВалютная"] - ТекДанные["СуммаНДСКВычетуВалютная"];
		
	КонецЕсли;
	
	ОбновитьЗначенияОтметитьСтроку(ТекДанные);
	
КонецПроцедуры	

//---
// Аналог установки свойства ТолькоПросмотр, но с возможностью открытия значения

&НаСервере
Процедура ТолькоПросмотр_ПоДаннымУчета_ИнициализацияСервер()
	
	НастройкиТаблиц = Новый Структура();
	
	НастройкиОднойТаблицы = Новый Структура();
	НастройкиОднойТаблицы.Вставить("ИмяФлажкаПоДаннымУчета", "ПоУчету");
	НастройкиОднойТаблицы.Вставить("ИменаЭлементов",
		"СоставРаспределяемыхСуммКонтрагент,
		|СоставРаспределяемыхСуммОбъектНалогообложения,
		|СоставРаспределяемыхСуммВидЦенности,
		|СоставРаспределяемыхСуммСтавкаНДС,
		|СоставРаспределяемыхСуммВалюта");
	НастройкиТаблиц.Вставить("СоставРаспределяемыхСумм", НастройкиОднойТаблицы);
	
	УчетНДС.ТолькоПросмотр_ПоДаннымУчета_Инициализация(ЭтаФорма, НастройкиТаблиц);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ТолькоПросмотр_ПоДаннымУчета_Таблица_ПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	УчетНДСКлиентСервер.ТолькоПросмотр_ПоДаннымУчета_Клиент_НастроитьЭлементыТекущейСтроки(ЭтаФорма, Элемент, НоваяСтрока);
	
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ТолькоПросмотр_ПоДаннымУчета_Таблица_ПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	УчетНДСКлиентСервер.ТолькоПросмотр_ПоДаннымУчета_Клиент_НастроитьЭлементыТекущейСтроки(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ТолькоПросмотр_ПоДаннымУчета_Поле_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УчетНДСКлиентСервер.ТолькоПросмотр_ПоДаннымУчета_Клиент_ОтменитьСтандартнуюОбработкуСобытия(ЭтаФорма, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ТолькоПросмотр_ПоДаннымУчета_Поле_Очистка(Элемент, СтандартнаяОбработка)
	
	УчетНДСКлиентСервер.ТолькоПросмотр_ПоДаннымУчета_Клиент_ОтменитьСтандартнуюОбработкуСобытия(ЭтаФорма, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ТолькоПросмотр_ПоДаннымУчета_Поле_ОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	УчетНДСКлиентСервер.ТолькоПросмотр_ПоДаннымУчета_Клиент_ОтменитьСтандартнуюОбработкуСобытия(ЭтаФорма, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

//---
// Заполнение документа

&НаКлиенте
Процедура ПроверитьИЗаполнитьДокумент()
	
	ЕстьЗаполненнаяТаблица	= (Объект["СоставРаспределяемыхСумм"].Количество() > 0);
	
	ЕстьЗаполненныеСуммы	= НЕ (Объект["СуммаРеализацииВсего"] = 0
		И Объект["СуммаРеализацииНДС"] = 0
		И Объект["СуммаРеализацииОблагаемаяБезНДС"] = 0);	
	
	Если ЕстьЗаполненнаяТаблица ИЛИ ЕстьЗаполненныеСуммы Тогда
		ТекстСообщения = НСтр("ru='Перед заполнением по данным учета документ будет очищен.
			|
			|Продолжить и заполнить по данным учета?'");
			
		ОписаниеОповещенияОВыборе = Новый ОписаниеОповещения("ПроверитьИЗаполнитьДокумент_Выбор", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещенияОВыборе, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
	Иначе
		ЗаполнитьДокументКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИЗаполнитьДокумент_Выбор(Результат, ПараметрыОповещения) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ЗаполнитьДокументКлиент();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДокументКлиент()
	
	ИмяКоманды = "ЗаполнитьДокумент";
	
	ЗаполнитьПоДаннымБухУчетаКлиент(ИмяКоманды);
	
	РаспределитьПоПропорцииКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИЗаполнитьСуммыРеализации()
	
	ЕстьЗаполненныеСуммы = НЕ (Объект["СуммаРеализацииВсего"] = 0
		И Объект["СуммаРеализацииНДС"] = 0
		И Объект["СуммаРеализацииОблагаемаяБезНДС"] = 0);
		
	Если ЕстьЗаполненныеСуммы Тогда
		ТекстСообщения = НСтр("ru='Суммы реализации будут перезаполнены по данным бухгалтерского учета.
			|
			|Продолжить?'");
			
		ОписаниеОповещенияОВыборе = Новый ОписаниеОповещения("ПроверитьИЗаполнитьСуммыРеализации_Выбор", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещенияОВыборе, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
	Иначе
		ЗаполнитьСуммыРеализацииКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИЗаполнитьСуммыРеализации_Выбор(Результат, ПараметрыОповещения) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ЗаполнитьСуммыРеализацииКлиент();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСуммыРеализацииКлиент()
	
	ИмяКоманды = "ЗаполнитьСуммыРеализации";
	
	ЗаполнитьПоДаннымБухУчетаКлиент(ИмяКоманды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИЗаполнитьСуммыКРаспределению(ИмяКоманды)
	
	ЕстьЗаполненнаяТаблица	= (Объект["СоставРаспределяемыхСумм"].Количество() > 0);
	
	Если ЕстьЗаполненнаяТаблица Тогда
		ТекстСообщения = НСтр("ru='Перед заполнением по данным учета будет очищена
			|табличная часть ""Суммы к распределению"".
			|
			|Продолжить и заполнить по данным учета?'");
			
		ДополнительныеПараметры = Новый Структура();
		ДополнительныеПараметры.Вставить("ИмяКоманды", ИмяКоманды);
		
		ОписаниеОповещенияОВыборе = Новый ОписаниеОповещения("ПроверитьИЗаполнитьСуммыКРаспределению_Выбор", ЭтотОбъект, ДополнительныеПараметры);
		
		ПоказатьВопрос(ОписаниеОповещенияОВыборе, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
	Иначе
		ЗаполнитьСуммыКРаспределениюКлиент(ИмяКоманды);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИЗаполнитьСуммыКРаспределению_Выбор(Результат, ПараметрыОповещения) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ЗаполнитьСуммыКРаспределениюКлиент(ПараметрыОповещения["ИмяКоманды"]);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСуммыКРаспределениюКлиент(ИмяКоманды)
	
	ЗаполнитьПоДаннымБухУчетаКлиент(ИмяКоманды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИРаспределитьПоПропорции()
	
	ЕстьЗаполненнаяТаблица	= (Объект["СоставРаспределяемыхСумм"].Количество() > 0);
	
	Если ЕстьЗаполненнаяТаблица Тогда
		ТекстСообщения = НСтр("ru='В табличной части ""Суммы к распределению"" будут пересчитаны суммы НДС.
			|
			|Продолжить?'");
			
		ОписаниеОповещенияОВыборе = Новый ОписаниеОповещения("ПроверитьИРаспределитьПоПропорции_Выбор", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещенияОВыборе, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
	Иначе
		РаспределитьПоПропорцииКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИРаспределитьПоПропорции_Выбор(Результат, ПараметрыОповещения) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		РаспределитьПоПропорцииКлиент();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьПоПропорцииКлиент()
	
	ТаблЧасть = Объект["СоставРаспределяемыхСумм"];
	Для Каждого СтрокаТЧ Из ТаблЧасть Цикл
		СтрокаТЧ["СуммаНДСКВычету"] 	= СтрокаТЧ["СуммаНДСВсего"] * ДоляПринимаемаяКВычету;
		СтрокаТЧ["СуммаНДСВСтоимость"] 	= СтрокаТЧ["СуммаНДСВсего"] - СтрокаТЧ["СуммаНДСКВычету"];
		
		СтрокаТЧ["СуммаНДСКВычетуВалютная"] 	= СтрокаТЧ["СуммаНДСВсегоВалютная"] * ДоляПринимаемаяКВычету;
		СтрокаТЧ["СуммаНДСВСтоимостьВалютная"] 	= СтрокаТЧ["СуммаНДСВсегоВалютная"] - СтрокаТЧ["СуммаНДСКВычетуВалютная"];
		
		ОбновитьЗначенияОтметитьСтроку(СтрокаТЧ);
	КонецЦикла;
	
КонецПроцедуры	


// Заполнение аналитики затрат по КФО и КПС

&НаКлиенте
Процедура ОткрытьФормуЗаполненияСчетаДтКлиент()
	
	ПараметрыФормы = ПолучитьПараметрыОткрытияФормыЗаполненияСчетаДебетаСервер();
	
	ОписаниеОповещенияОВыборе = Новый ОписаниеОповещения("ОткрытьФормуЗаполненияСчетаДтКлиент_Выбор", ЭтотОбъект);
	
	ОткрытьФорму("Документ.РаспределениеВходящегоНДС.Форма.ФормаЗаполненияСчетаДт", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещенияОВыборе, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЗаполненияСчетаДтКлиент_Выбор(Результат, ПараметрыОповещения) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ЗаполнитьСчетаДебетаСервер(Результат["СчетаДебета"]);
		
		Объект["ВидЗатрат"] = Результат["ВидЗатрат"];
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыОткрытияФормыЗаполненияСчетаДебетаСервер()
	
	ЗапросТаблица = Новый Запрос();
	ЗапросТаблица.УстановитьПараметр("ТЗСоставРаспределяемыхСумм", Объект["СоставРаспределяемыхСумм"].Выгрузить());
	ЗапросТаблица.Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Исходная табличная часть СоставРаспределяемыхСумм
	|//
	|ВЫБРАТЬ
	|	ТЧ.НомерСтроки			КАК НомерСтроки,
	|	ТЧ.СчетДт				КАК СчетДт,
	|	ТЧ.КЭКСчетаДебета		КАК КЭКСчетаДебета,
	|	ТЧ.СубконтоДт1			КАК СубконтоДт1,
	|	ТЧ.СубконтоДт2			КАК СубконтоДт2,
	|	ТЧ.СубконтоДт3			КАК СубконтоДт3,
	|	// Поле свертки
	|	ТЧ.КФО					КАК КФО,
	|	ТЧ.КПССчетаДебета		КАК КПССчетаДебета
	|ПОМЕСТИТЬ
	|	ТаблЧастьСоставРаспределяемыхСумм
	|ИЗ
	|	&ТЗСоставРаспределяемыхСумм	КАК ТЧ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Количество различных значений каждого поля
	|//
	|ВЫБРАТЬ
	|	МИНИМУМ(НомерСтроки)					КАК НомерПервойСтроки,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СчетДт)			КАК КолвоРазличныхСчетДт,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КЭКСчетаДебета)	КАК КолвоРазличныхКЭКСчетаДебета,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СубконтоДт1)		КАК КолвоРазличныхСубконтоДт1,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СубконтоДт2)		КАК КолвоРазличныхСубконтоДт2,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СубконтоДт3)		КАК КолвоРазличныхСубконтоДт3,
	|	МИНИМУМ(СчетДт)							КАК СчетДт,
	|	МИНИМУМ(КЭКСчетаДебета)					КАК КЭКСчетаДебета,
	|	МИНИМУМ(СубконтоДт1)					КАК СубконтоДт1,
	|	МИНИМУМ(СубконтоДт2)					КАК СубконтоДт2,
	|	МИНИМУМ(СубконтоДт3)					КАК СубконтоДт3,
	|	// Поле свертки
	|	КФО										КАК КФО,
	|	КПССчетаДебета							КАК КПССчетаДебета
	|ПОМЕСТИТЬ
	|	КоличествоСтрокСРазличнымиПолями
	|ИЗ
	|	ТаблЧастьСоставРаспределяемыхСумм
	|СГРУППИРОВАТЬ ПО
	|	// Поле свертки     
	|	КФО,
	|	КПССчетаДебета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [2]. Таблица счетов дебета с установленными значениями полей
	|//		(Финальная таблица)
	|//
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА КолвоРазличныхСчетДт = 1 ТОГДА
	|			СчетДт
	|		ИНАЧЕ
	|			НЕОПРЕДЕЛЕНО
	|	КОНЕЦ									КАК СчетДт,
	|	ВЫБОР
	|		КОГДА КолвоРазличныхКЭКСчетаДебета = 1 ТОГДА
	|			КЭКСчетаДебета
	|		ИНАЧЕ
	|			НЕОПРЕДЕЛЕНО
	|	КОНЕЦ									КАК КЭКСчетаДебета,
	|	ВЫБОР
	|		КОГДА КолвоРазличныхСубконтоДт1 = 1 ТОГДА
	|			СубконтоДт1
	|		ИНАЧЕ
	|			НЕОПРЕДЕЛЕНО
	|	КОНЕЦ									КАК СубконтоДт1,
	|	ВЫБОР
	|		КОГДА КолвоРазличныхСубконтоДт2 = 1 ТОГДА
	|			СубконтоДт2
	|		ИНАЧЕ
	|			НЕОПРЕДЕЛЕНО
	|	КОНЕЦ									КАК СубконтоДт2,
	|	ВЫБОР
	|		КОГДА КолвоРазличныхСубконтоДт3 = 1 ТОГДА
	|			СубконтоДт3
	|		ИНАЧЕ
	|			НЕОПРЕДЕЛЕНО
	|	КОНЕЦ									КАК СубконтоДт3,
	|	// Поле свертки     
	|	КФО										КАК КФО,
	|	КПССчетаДебета							КАК КПССчетаДебета
	|ИЗ
	|	КоличествоСтрокСРазличнымиПолями
	|УПОРЯДОЧИТЬ ПО
	|	НомерПервойСтроки
	|;";
	
	ТЗСчетаДебета = ЗапросТаблица.Выполнить().Выгрузить();
	
	Данные = Новый Структура("
		|Дата,
		|Организация,
		|ИФО,
		|ВидЗатрат");
	ЗаполнитьЗначенияСвойств(Данные, Объект);
	
	Данные.Вставить("СчетаДебета", ТЗСчетаДебета);
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Данные);
	
	Результат = Новый Структура();
	Результат.Вставить("АдресХранилища",			АдресХранилища);
	Результат.Вставить("РежимЗаполненияПоКФОиКПС",	Истина);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСчетаДебетаСервер(ИсточникДанных)
	
	ПоляПоиска = "КФО,КПССчетаДебета";
	
	ЗаполняемыеПоля = "СчетДт,КЭКСчетаДебета,СубконтоДт1,СубконтоДт2,СубконтоДт3";
	
	Поиск = Новый Структура(ПоляПоиска);
	
	Для Каждого СтрокаТаблицы Из ИсточникДанных Цикл
		
		ЗаполнитьЗначенияСвойств(Поиск, СтрокаТаблицы);
		
		МассивСтрок = Объект["СоставРаспределяемыхСумм"].НайтиСтроки(Поиск);
		
		Если МассивСтрок.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого СтрокаПриемник Из МассивСтрок Цикл
			ЗаполнитьЗначенияСвойств(СтрокаПриемник, СтрокаТаблицы, ЗаполняемыеПоля);
			
			УстановитьФлажокОтразитьВКарточкеКапвложений(СтрокаПриемник, СчетаКапвложений);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры


// Групповое заполнение строк

&НаКлиенте
Функция ПолучитьПараметрыФормыГрупповогоЗаполненияСтрок(КоличествоСтрок)
	
	СтруктураДанных = Новый Структура("
		|Дата,
		|Организация,
		|ИФО");
	
	ЗаполнитьЗначенияСвойств(СтруктураДанных, Объект);
	
	ТекущиеДанные = Новый Структура("
		|КФО,
		|КПССчетаДебета,
		|СчетДт,
		|КЭКСчетаДебета,
		|СубконтоДт1,
		|СубконтоДт2,
		|СубконтоДт3");
		
	ТекДанные = Элементы["СоставРаспределяемыхСумм"].ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, ТекДанные);
		
	КонецЕсли;
	
	СтруктураДанных.Вставить("ТекущиеДанные", ТекущиеДанные);
	
	Результат = Новый Структура();
	Результат.Вставить("СтруктураДанных",			СтруктураДанных);
	Результат.Вставить("РежимЗаполненияПоКФОиКПС",	Ложь);
	Результат.Вставить("КоличествоСтрок",			КоличествоСтрок);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗакрытаФормаГрупповогоЗаполненияСтрок(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы["СоставРаспределяемыхСумм"].ВыделенныеСтроки;
	
	ТабличнаяЧасть = Объект["СоставРаспределяемыхСумм"];
	
	Для Каждого ИдСтроки Из ВыделенныеСтроки Цикл
		
		СтрокаТаблицы = ТабличнаяЧасть.НайтиПоИдентификатору(ИдСтроки);
		
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, РезультатВыбора);
		
		УстановитьФлажокОтразитьВКарточкеКапвложений(СтрокаТаблицы, СчетаКапвложений);
	КонецЦикла;
	
КонецПроцедуры


// Заполнение по данным учета

&НаКлиенте
Процедура ЗаполнитьПоДаннымБухУчетаКлиент(ИмяКоманды)
	
	РезультатЗадания = ЗаполнитьПоДаннымБухУчетаСервер(ИмяКоманды);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("ЗавершениеЗаполненияПоДаннымБухУчетаКлиент", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатЗадания, ОписаниеОповещенияЗавершение, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПоДаннымБухУчетаСервер(ИмяКоманды)
	
	ПараметрыЗадания = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыЗадания.НаименованиеФоновогоЗадания = НСтр("ru='Распределение входящего НДС'");
	
	ПараметрыПроцедуры = ПолучитьПараметрыПроцедурыЗаполненияПоДаннымУчета(ИмяКоманды);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Документы.РаспределениеВходящегоНДС.ПолучитьДанныеБухУчета",
		ПараметрыПроцедуры, ПараметрыЗадания);
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеЗаполненияПоДаннымБухУчетаКлиент(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		ЗавершениеЗаполненияПоДаннымБухУчетаСервер(Результат.АдресРезультата);
		
		РаспределитьПоПропорцииКлиент();
		
	Иначе
		
		ПоказатьПредупреждение(, НСтр("ru='При распределении входящего НДС возникла ошибка'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершениеЗаполненияПоДаннымБухУчетаСервер(АдресРезультата)
	
	Перем Значение;
	
	РезультатыЗаполнения = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если РезультатыЗаполнения.Свойство("СуммыРеализации", Значение) Тогда
		
		ЗаполнитьЗначенияСвойств(Объект, Значение);
		
		РезультатРасчета = РассчитатьДолюПринимаемуюКВычету(Значение);
		
		НастроитьФормуПослеРасчетаДолиКВычету(ЭтаФорма, РезультатРасчета);
		
	КонецЕсли;
	
	Если РезультатыЗаполнения.Свойство("СоставРаспределяемыхСумм", Значение) Тогда
		
		Объект["СоставРаспределяемыхСумм"].Загрузить(Значение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыПроцедурыЗаполненияПоДаннымУчета(ИмяКоманды)
	
	ШапкаДокумента = ПолучитьСтруктуруШапкиДокумента();
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("ШапкаДокумента", ШапкаДокумента);
	
	Если ИмяКоманды = "ЗаполнитьДокумент" Тогда
		ПараметрыПроцедуры.Вставить("ЗаполнитьСуммыРеализации");
		ПараметрыПроцедуры.Вставить("ЗаполнитьРаспределяемыеСуммыСАналитикой");
		
	ИначеЕсли ИмяКоманды = "ЗаполнитьСуммыРеализации" Тогда
		ПараметрыПроцедуры.Вставить("ЗаполнитьСуммыРеализации");
		
	ИначеЕсли ИмяКоманды = "ЗаполнитьБезАналитики" Тогда
		ПараметрыПроцедуры.Вставить("ЗаполнитьРаспределяемыеСуммыБезАналитики");
		
	ИначеЕсли ИмяКоманды = "ЗаполнитьСАналитикой" Тогда
		ПараметрыПроцедуры.Вставить("ЗаполнитьРаспределяемыеСуммыСАналитикой");
		
	КонецЕсли;
	
	Возврат ПараметрыПроцедуры;
	
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруШапкиДокумента()
	
	ШапкаДокумента = Новый Структура(Документы.РаспределениеВходящегоНДС.ПолучитьИменаРеквизитовШапкиДляПоискаОстатков());
	
	ЗаполнитьЗначенияСвойств(ШапкаДокумента, Объект);
	
	Возврат ШапкаДокумента;
	
КонецФункции


&НаКлиентеНаСервереБезКонтекста
Функция РассчитатьДолюПринимаемуюКВычету(СтруктураСумм)
	
	ДоляПринимаемаяКВычету						= 0;
	ОтметитьПолеСуммаРеализацииНДС				= Ложь;
	ОтметитьПолеСуммаРеализацииОблагаемаяБезНДС	= Ложь;
	
	Числитель = СтруктураСумм["СуммаРеализацииОблагаемаяБезНДС"];
	
	Знаменатель = СтруктураСумм["СуммаРеализацииВсего"] - СтруктураСумм["СуммаРеализацииНДС"];
	
	ОперандыЗнаменателяПустые = (СтруктураСумм["СуммаРеализацииВсего"] = 0 И СтруктураСумм["СуммаРеализацииНДС"] = 0);
	
	Если Знаменатель > 0 Тогда
		
		Если Числитель <= Знаменатель Тогда
			
			ДоляПринимаемаяКВычету = Числитель / Знаменатель;
			
		Иначе
			ОтметитьПолеСуммаРеализацииОблагаемаяБезНДС = Истина;
			
		КонецЕсли;
		
	ИначеЕсли НЕ ОперандыЗнаменателяПустые Тогда
		
		ОтметитьПолеСуммаРеализацииНДС = Истина;
			
	КонецЕсли;
	
	Результат = Новый Структура();
	Результат.Вставить("ДоляПринимаемаяКВычету",						ДоляПринимаемаяКВычету);
	Результат.Вставить("ОтметитьПолеСуммаРеализацииНДС",				ОтметитьПолеСуммаРеализацииНДС);
	Результат.Вставить("ОтметитьПолеСуммаРеализацииОблагаемаяБезНДС",	ОтметитьПолеСуммаРеализацииОблагаемаяБезНДС);
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьФормуПослеРасчетаДолиКВычету(Форма, РезультатРасчета)
	
	ЗаполнитьЗначенияСвойств(Форма, РезультатРасчета);
	
	ИмяПоля = "СуммаРеализацииОблагаемаяБезНДС";
	
	Элемент = Форма.Элементы[ИмяПоля];
	
	Если РезультатРасчета["ОтметитьПоле" + ИмяПоля] Тогда
		Элемент.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСправа;
	Иначе
		Элемент.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	КонецЕсли;
	
	ИмяПоля = "СуммаРеализацииНДС";
	
	Элемент = Форма.Элементы[ИмяПоля];
	
	Если РезультатРасчета["ОтметитьПоле" + ИмяПоля] Тогда
		Элемент.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСправа;
	Иначе
		Элемент.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	//---
	// Таблица Суммы к распределению, надпись "в рублях"
	//---
	ЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Таблица ""Суммы к распределению"" - надпись ""в рублях""'");
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='в рублях'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ГоризонтальноеПоложение", ГоризонтальноеПоложение.Право);
	// Условие
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение	= Истина;
	Условие.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение	= Истина;
	// Оформляемые поля
	ИмяЭлемента = "СоставРаспределяемыхСуммНадписьВРублях";
	ПолеДляОформления = ЭлементУО.Поля.Элементы.Добавить();
	ПолеДляОформления.Поле = Новый ПолеКомпоновкиДанных(ИмяЭлемента);
	
	//---
	// Таблица Суммы к распределению, надпись "в валюте"
	//---
	ЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Таблица ""Суммы к распределению"" - надпись ""в валюте""'");
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='в валюте'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ГоризонтальноеПоложение", ГоризонтальноеПоложение.Право);
	// Условие
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение	= Истина;
	Условие.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение	= Истина;
	// Оформляемые поля
	ИмяЭлемента = "СоставРаспределяемыхСуммНадписьВВалюте";
	ПолеДляОформления = ЭлементУО.Поля.Элементы.Добавить();
	ПолеДляОформления.Поле = Новый ПолеКомпоновкиДанных(ИмяЭлемента);
	
	//---
	// Поле "Сумма НДС с реализации" - отметка корректного значения
	//---
	ЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Поле ""Сумма НДС с реализации"" - отметка корректного значения'");
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	// Условие
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("ОтметитьПолеСуммаРеализацииНДС");
	Условие.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение	= Ложь;
	// Оформляемые поля
	ПолеДляОформления = ЭлементУО.Поля.Элементы.Добавить();
	ПолеДляОформления.Поле = Новый ПолеКомпоновкиДанных("СуммаРеализацииНДС");
	
	//---
	// Поле "Сумма НДС с реализации" - отметка некорректного значения
	//---
	ЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Поле ""Сумма НДС с реализации"" - отметка некорректного значения'");
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	// Условие
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("ОтметитьПолеСуммаРеализацииНДС");
	Условие.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение	= Истина;
	// Оформляемые поля
	ПолеДляОформления = ЭлементУО.Поля.Элементы.Добавить();
	ПолеДляОформления.Поле = Новый ПолеКомпоновкиДанных("СуммаРеализацииНДС");
	
	//---
	// Поле "Сумма реализации по облагаемой деятельности (без НДС)" - отметка корректного значения
	//---
	ЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Поле ""Сумма реализации по облагаемой деятельности (без НДС)"" - отметка корректного значения'");
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	// Условие
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("ОтметитьПолеСуммаРеализацииОблагаемаяБезНДС");
	Условие.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение	= Ложь;
	// Оформляемые поля
	ПолеДляОформления = ЭлементУО.Поля.Элементы.Добавить();
	ПолеДляОформления.Поле = Новый ПолеКомпоновкиДанных("СуммаРеализацииОблагаемаяБезНДС");
	
	//---
	// Поле "Сумма реализации по облагаемой деятельности (без НДС)" - отметка некорректного значения
	//---
	ЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Поле ""Сумма реализации по облагаемой деятельности (без НДС)"" - отметка некорректного значения'");
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	// Условие
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("ОтметитьПолеСуммаРеализацииОблагаемаяБезНДС");
	Условие.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение	= Истина;
	// Оформляемые поля
	ПолеДляОформления = ЭлементУО.Поля.Элементы.Добавить();
	ПолеДляОформления.Поле = Новый ПолеКомпоновкиДанных("СуммаРеализацииОблагаемаяБезНДС");
	
	//---
	// Таблица "Суммы к распределению" - отметка строк в кот.нарушается равенство сумм НДС (всего, к вычету и в стоимость)
	//---
	ЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Таблица ""Суммы к распределению"" - отметка строк в кот.нарушается равенство сумм НДС (всего, к вычету и в стоимость)'");
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОсобогоТекста);
	// Условие
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("Объект.СоставРаспределяемыхСумм.ОтметитьКолонкиКВычетуИВСтоимость");
	Условие.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение	= Истина;
	// Оформляемые поля
	ПолеДляОформления = ЭлементУО.Поля.Элементы.Добавить();
	ПолеДляОформления.Поле = Новый ПолеКомпоновкиДанных("СоставРаспределяемыхСуммСуммаНДСВсего");
	ПолеДляОформления = ЭлементУО.Поля.Элементы.Добавить();
	ПолеДляОформления.Поле = Новый ПолеКомпоновкиДанных("СоставРаспределяемыхСуммСуммаНДСКВычету");
	ПолеДляОформления = ЭлементУО.Поля.Элементы.Добавить();
	ПолеДляОформления.Поле = Новый ПолеКомпоновкиДанных("СоставРаспределяемыхСуммСуммаНДСВСтоимость");
	
	//---
	// Таблица "Суммы к распределению" - отметка строк в кот.нарушается равенство сумм НДС (всего, к вычету и в стоимость)
	//---
	ЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Таблица ""Суммы к распределению"" - отметка строк в кот.нарушается равенство сумм НДС (всего, к вычету и в стоимость)'");
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,,Истина)); // наклонный
	// Условие
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("Объект.СоставРаспределяемыхСумм.ОтметитьКолонкиКВычетуИВСтоимость");
	Условие.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение	= Истина;
	// Оформляемые поля
	ПолеДляОформления = ЭлементУО.Поля.Элементы.Добавить();
	ПолеДляОформления.Поле = Новый ПолеКомпоновкиДанных("СоставРаспределяемыхСуммСуммаНДСВсего");
	
	//---
	// Таблица "Суммы к распределению (валютные)" - отметка строк в кот.нарушается равенство сумм НДС (всего, к вычету и в стоимость)
	//---
	ЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Таблица ""Суммы к распределению (валютные)"" - отметка строк в кот.нарушается равенство сумм НДС (всего, к вычету и в стоимость)'");
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОсобогоТекста);
	// Условие
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("Объект.СоставРаспределяемыхСумм.ОтметитьКолонкиКВычетуИВСтоимостьВалютная");
	Условие.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение	= Истина;
	// Оформляемые поля
	ПолеДляОформления = ЭлементУО.Поля.Элементы.Добавить();
	ПолеДляОформления.Поле = Новый ПолеКомпоновкиДанных("СоставРаспределяемыхСуммСуммаНДСВсегоВалютная");
	ПолеДляОформления = ЭлементУО.Поля.Элементы.Добавить();
	ПолеДляОформления.Поле = Новый ПолеКомпоновкиДанных("СоставРаспределяемыхСуммСуммаНДСКВычетуВалютная");
	ПолеДляОформления = ЭлементУО.Поля.Элементы.Добавить();
	ПолеДляОформления.Поле = Новый ПолеКомпоновкиДанных("СоставРаспределяемыхСуммСуммаНДСВСтоимостьВалютная");
	
	//---
	// Таблица "Суммы к распределению (валютные)" - отметка строк в кот.нарушается равенство сумм НДС (всего)
	//---
	ЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Таблица ""Суммы к распределению (валютные)"" - отметка строк в кот.нарушается равенство сумм НДС (всего)'");
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,,Истина)); // наклонный
	// Условие
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("Объект.СоставРаспределяемыхСумм.ОтметитьКолонкиКВычетуИВСтоимостьВалютная");
	Условие.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение	= Истина;
	// Оформляемые поля
	ПолеДляОформления = ЭлементУО.Поля.Элементы.Добавить();
	ПолеДляОформления.Поле = Новый ПолеКомпоновкиДанных("СоставРаспределяемыхСуммСуммаНДСВсегоВалютная");
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыИтогов()
	
	// ВНЕШНИЙ ВИД ИТОГОВ ТАБЛИЦ
	//
	//	----------------------------------------
	//			ИспользоватьВалютныйУчет
	//	--------------------+-------------------
	//			Истина		|		Ложь
	//	--------------------+-------------------
	//	Всего               |
	//	в рублях: _________	|	Всего: _________
	//	в валюте: _________	|
	//	----------------------------------------
	
	ИспользоватьВалютныйУчет = ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет");
	
	//---
	// Итоги таблицы Суммы к распределению
	//---
	ИменаЭлементов = Новый Структура();
	//						Имя элемента-группы					Имя элемента-поля для рублевой суммы
	ИменаЭлементов.Вставить("ГруппаИтогиВсего",					"СоставРаспределяемыхСуммИтогВсего");
	ИменаЭлементов.Вставить("ГруппаИтогиСуммаНДС",				"СоставРаспределяемыхСуммИтогСуммаНДСВсего");
	ИменаЭлементов.Вставить("ГруппаИтогиСуммаНДСКВычету",		"СоставРаспределяемыхСуммИтогСуммаНДСКВычету");
	ИменаЭлементов.Вставить("ГруппаИтогиСуммаНДСВСтоимость",	"СоставРаспределяемыхСуммИтогСуммаНДСВСтоимость");
	
	ОтображатьЗаголовокГруппы = ИспользоватьВалютныйУчет;
	
	Для Каждого Элемент Из ИменаЭлементов Цикл
		ИмяЭлементаГруппы	= Элемент.Ключ;
		ИмяЭлементаПоля		= Элемент.Значение;
		
		УстановитьЗаголовокПоля = НЕ ИспользоватьВалютныйУчет;
		
		// Элемент группы
		Элементы[ИмяЭлементаГруппы].ОтображатьЗаголовок = ОтображатьЗаголовокГруппы;
		
		// Элемент поля
		Если УстановитьЗаголовокПоля Тогда
			Элементы[ИмяЭлементаПоля].Заголовок				= Элементы[ИмяЭлементаГруппы].Заголовок;
			Элементы[ИмяЭлементаПоля].ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Лево;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
	
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьФлажокОтразитьВКарточкеКапвложений(СтрокаТЧ, СчетаКапвложений)
	СтрокаКапвложений = (СчетаКапвложений.НайтиПоЗначению(СтрокаТЧ.СчетДт) <> Неопределено);
	Если СтрокаКапвложений И НЕ СтрокаТЧ.ОтразитьВКарточкеКапвложений Тогда
		СтрокаТЧ.ОтразитьВКарточкеКапвложений = Истина;
	ИначеЕсли НЕ СтрокаКапвложений И СтрокаТЧ.ОтразитьВКарточкеКапвложений Тогда
		СтрокаТЧ.ОтразитьВКарточкеКапвложений = Ложь;
	КонецЕсли;	
КонецПроцедуры	

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ТиповыеОперации

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтаФорма.Элементы[ИмяЭлемента]);	

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКурсВалюты(Команда)

	БухгалтерскиеОперацииКлиент.ОбновитьКурсВалюты(ЭтаФорма, Объект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)

	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтаФорма, Команда);	

КонецПроцедуры 

#КонецОбласти

#Область ИнформационныйЦентр

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

#КонецОбласти
